run/multShock_methaneAirGlobal_1D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

L   20;
N   1000;

vertices
(
    (0  -0.5 -0.5)
    ($L -0.5 -0.5)
    ($L  0.5 -0.5)
    (0   0.5 -0.5)
    (0  -0.5  0.5)
    ($L -0.5  0.5)
    ($L  0.5  0.5)
    (0   0.5  0.5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (#calc "$N*$L" 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    left
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    right
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }
    empty
    {
        type empty;
        faces
        (
            (1 5 4 0)
            (3 7 6 2)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
