run/multShock_methaneAirGlobal_1D/0/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    left
    {
        type            fixedValue;
        value           $internalField;
        // type            waveTransmissive;
        // gamma           1.4;
        // fieldInf        (0 0 0);
        // lInf            1e3;
    }

    right
    {
        // type            zeroGradient;
        
        type            waveTransmissive;
        gamma           1.4;
        fieldInf        (0 0 0);
        lInf            1e3;
    }

    empty
    {
        type            empty;
    }
}


// ************************************************************************* //
